In [1]:
"""Pandas uses for data manipulation -> cleaning,transforming and structuring data and data analysis -> finding patterns, trends,extract insights from data"""

'Pandas uses for data manipulation -> cleaning,transforming and structuring data and data analysis -> finding patterns, trends,extract insights from data'

In [3]:
import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [23]:
import pandas as pd
data={
    "NAME":["Ram","Pranav"],
    "AGE":[10,21],
    "CITY":['Nagpur','Pune']
}
df=pd.DataFrame(data)
df
#df.to_csv("New_data") -> To Save the File

     NAME  AGE    CITY
0     Ram   10  Nagpur
1  Pranav   21    Pune

In [27]:
#head() -> Gives 1st 5 lines 
#tail() -> Gives last 5 lines

import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df
print(df.head())
print(df.tail())

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
    YearsExperience  Salary
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [29]:
#info() -> Shows ALL information about data
import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 612.0 bytes

In [37]:
#describe()
import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [47]:
import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df
print(df.shape)
print(df.columns)

(30, 2)
Index(['YearsExperience', 'Salary'], dtype='object')

In [282]:
""" Selecting columns
1) Series
2) Dataframe multiple columns of data

column = df["Column Name"]
subset = df[["Column1", "column2"]]

Filtering rows
1)Boolean indexing"""

import pandas as pd
df=pd.read_csv("salary_data - salary_data.csv")
df

print(df.head()["Salary"])
print(df.head()[['YearsExperience', 'Salary']])

0    39343
1    46205
2    37731
3    43525
4    39891
Name: Salary, dtype: int64
   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [274]:
import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27],
    "Salary":[50000,60000,70000,80000,45000,100000,55555],
    "Performance Score":[85,74,92,66,55,78,95]
}
df=pd.DataFrame(data)
df

high_salary =df[df['Salary']>50000]
print(high_salary)

filtered=df[(df["Age"]>20) & (df["Salary"]>50000)]
print(filtered)

filtered_or=df[(df["Age"]>20) | (df["Salary"]>50000)]
print(filtered_or)

     Name  Age  Salary  Performance Score
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Age  Salary  Performance Score
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Age  Salary  Performance Score
0  Pranav   21   50000                 85
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
4   Virat   25   45000                 55
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95

In [204]:
import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27],
    "Salary":[50000,60000,70000,80000,45000,100000,55555],
    "Performance Score":[85,74,92,66,55,78,95]
}
df=pd.DataFrame(data)
print(df)

df["Bonus"] = df["Salary"]*0.1
print(df)
 
#using -> df.insert(index,"Column_name",(some data)) -> adding new column
df.insert(0,"Employe_id",(10,20,30,40,50,60,70))
print(df)

     Name  Age  Salary  Performance Score
0  Pranav   21   50000                 85
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
4   Virat   25   45000                 55
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Age  Salary  Performance Score    Bonus
0  Pranav   21   50000                 85   5000.0
1    Yash   22   60000                 74   6000.0
2  Pratik   23   70000                 92   7000.0
3   Rohan   24   80000                 66   8000.0
4   Virat   25   45000                 55   4500.0
5   Rohit   26  100000                 78  10000.0
6   Mohit   27   55555                 95   5555.5
   Employe_id    Name  Age  Salary  Performance Score    Bonus
0          10  Pranav   21   50000                 85   5000.0
1          20    Yash   22   60000                 74   6000.0
2          30  Pratik   23   70000                 92   7000.0
3          40   Rohan   24   80000                 66   8000.0
4          50   Virat   25   45000                 55   4500.0
5          60   Rohit   26  100000                 78  10000.0
6          70   Mohit   27   55555                 95   5555.5

In [206]:
import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27],
    "Salary":[50000,60000,70000,80000,45000,100000,55555],
    "Performance Score":[85,74,92,66,55,78,95]
}
df=pd.DataFrame(data)
print(df)

#df.loc[row_index,"Column_name"]=new_value -> for value update
df.loc[0,"Salary"]=55000
print(df)

#increasing salary by 5%
df["Salary"]=df["Salary"]*1.05
print(df)

     Name  Age  Salary  Performance Score
0  Pranav   21   50000                 85
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
4   Virat   25   45000                 55
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Age  Salary  Performance Score
0  Pranav   21   55000                 85
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
4   Virat   25   45000                 55
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Age     Salary  Performance Score
0  Pranav   21   57750.00                 85
1    Yash   22   63000.00                 74
2  Pratik   23   73500.00                 92
3   Rohan   24   84000.00                 66
4   Virat   25   47250.00                 55
5   Rohit   26  105000.00                 78
6   Mohit   27   58332.75                 95

In [105]:
import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27],
    "Salary":[50000,60000,70000,80000,45000,100000,55555],
    "Performance Score":[85,74,92,66,55,78,95]
}
df=pd.DataFrame(data)
print(df)

#df.drop(columns=["ColumnName"],inplace=True)

df.drop(columns=["Performance Score","Age"],inplace=True)
print(df)

     Name  Age  Salary  Performance Score
0  Pranav   21   50000                 85
1    Yash   22   60000                 74
2  Pratik   23   70000                 92
3   Rohan   24   80000                 66
4   Virat   25   45000                 55
5   Rohit   26  100000                 78
6   Mohit   27   55555                 95
     Name  Salary
0  Pranav   50000
1    Yash   60000
2  Pratik   70000
3   Rohan   80000
4   Virat   45000
5   Rohit  100000
6   Mohit   55555

In [202]:
"""1) NaN (Not  a number)
   2)None (for object data types)
   
   isnull()
   True=Nan is missing
   False=Value is present"""

import pandas as pd
data={
    "Name":["Pranav",None,"Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27,28],
    "Salary":[50000,60000,70000,80000,45000,100000,55555,28],
    "Performance Score":[85,74,None,92,66,55,78,95]
}
df=pd.DataFrame(data)
print(df)

print(df.isnull().sum())

     Name  Age  Salary  Performance Score
0  Pranav   21   50000               85.0
1    None   22   60000               74.0
2    Yash   23   70000                NaN
3  Pratik   24   80000               92.0
4   Rohan   25   45000               66.0
5   Virat   26  100000               55.0
6   Rohit   27   55555               78.0
7   Mohit   28      28               95.0
Name                 1
Age                  0
Salary               0
Performance Score    1
dtype: int64

In [166]:
#df.dropna(axis=0,inplace=True)
#df.fillna(value,iplace=True)

import pandas as pd
data={
    "Name":["Pranav",None,"Yash","Pratik","Rohan","Virat","Rohit","Mohit"],
    "Age":[21,22,23,24,25,26,27,28],
    "Salary":[50000,60000,70000,80000,45000,100000,55555,28],
    "Performance Score":[85,74,None,92,66,55,78,95]
}
df=pd.DataFrame(data)
print(df)

df.dropna(axis=1,inplace=True)
print(df)

df.fillna(1,inplace=True)
print(df)

     Name  Age  Salary  Performance Score
0  Pranav   21   50000               85.0
1    None   22   60000               74.0
2    Yash   23   70000                NaN
3  Pratik   24   80000               92.0
4   Rohan   25   45000               66.0
5   Virat   26  100000               55.0
6   Rohit   27   55555               78.0
7   Mohit   28      28               95.0
   Age  Salary
0   21   50000
1   22   60000
2   23   70000
3   24   80000
4   25   45000
5   26  100000
6   27   55555
7   28      28
   Age  Salary
0   21   50000
1   22   60000
2   23   70000
3   24   80000
4   25   45000
5   26  100000
6   27   55555
7   28      28

In [238]:
"""Linear , Polynomial , Time"""


import pandas as pd
data={
    "Time":[1,2,3,4,5],
    "Value":[10,None,30,None,50]
}
df=pd.DataFrame(data)
print("Before Interpolation")
print(df)

df["Value"]=df["Value"].interpolate(method="linear")
print("After Interpoliation")
print(df)

Before Interpolation
   Time  Value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0
After Interpoliation
   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [292]:
#Sorting data
#df.sort_values(by="column_name",True/False,inplace=True)

import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit"],
    "Age":[25,22,23,26,21,24],
    "Salary":[50000,60000,70000,80000,45000,100000]
}
df=pd.DataFrame(data)
print(df)

df.sort_values(by="Age",ascending=True,inplace=True)
print("\nSorted Age by Descending")
print(df)

     Name  Age  Salary
0  Pranav   25   50000
1    Yash   22   60000
2  Pratik   23   70000
3   Rohan   26   80000
4   Virat   21   45000
5   Rohit   24  100000

Sorted Age by Descending
     Name  Age  Salary
4   Virat   21   45000
1    Yash   22   60000
2  Pratik   23   70000
5   Rohit   24  100000
0  Pranav   25   50000
3   Rohan   26   80000

In [328]:
#Agreegation
#df["column name"].mean(),max(),min(),sum(),count(),std()

import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat","Rohit"],
    "Age":[25,22,23,26,21,24],
    "Salary":[50000,60000,70000,80000,45000,100000]
}
df=pd.DataFrame(data)
print(df)

avg_sal=df["Salary"].mean()
print(avg_sal)

avg_sal=df["Salary"].max()
print(avg_sal)

avg_sal=df["Salary"].count()
print(avg_sal)

     Name  Age  Salary
0  Pranav   25   50000
1    Yash   22   60000
2  Pratik   23   70000
3   Rohan   26   80000
4   Virat   21   45000
5   Rohit   24  100000
67500.0
100000
6

In [332]:
#Grouping
import pandas as pd
data={
    "Name":["Pranav","Yash","Pratik","Rohan","Virat"],
    "Age":[28,34,22,34,28],
    "Salary":[50000,60000,45000,52000,480000]
}
df=pd.DataFrame(data)
print(df)

grouped=df.groupby("Age")["Salary"].sum()
print(grouped)

     Name  Age  Salary
0  Pranav   28   50000
1    Yash   34   60000
2  Pratik   22   45000
3   Rohan   34   52000
4   Virat   28  480000
Age
22     45000
28    530000
34    112000
Name: Salary, dtype: int64

In [356]:
#df.merge[df1,df2,on="Column_name",how="type of join")

import pandas as pd

df_customers=pd.DataFrame({
    "Name":["Pranav","Yash","Pratik"],
    "Customer id":[1,2,3]
})

df_orders=pd.DataFrame({
    "Customer id":[1,2,4],
    "Order amount":[120,250,300]
})

df_merge=pd.merge(df_customers,df_orders,on="Customer id",how="outer")
print("Inner join")
print(df_merge)

Inner join
     Name  Customer id  Order amount
0  Pranav            1         120.0
1    Yash            2         250.0
2  Pratik            3           NaN
3     NaN            4         300.0